@file:Suppress(
    "PublicApiImplicitType",
    "KDocMissingDocumentation",
    "ObjectPropertyName",
    "RemoveRedundantBackticks",
    "unused",
    "NonAsciiCharacters",
    "SpellCheckingInspection",
    "DANGEROUS_CHARACTERS"
)


package koodies.kaomoji.categories

import koodies.kaomoji.Category

object Spin : Category() {
    val `(　・ω)(　・)(　)(・　)(ω・　)(・ω・)` by auto()
    val `(･∀･)( ･∀)( ･)( )(･ )(∀･ )(･∀･)` by auto()
    val `(･▽･)( ･▽)(　･)(　　)(･　)(▽･ )(･▽･)` by auto()
    val `(^▽^)( ^▽)(　^)(　　)(^　)(▽^ )(^▽^)` by auto()
    val `(^◇^)( ^◇)(　^)(　　)(^　)(◇^ )(^◇^)` by auto()
    val `(^ー^)( ^ー)(　^)(　　)(^　)(ー^ )(^ー^)` by auto()
    val `(^＿^)( ^_)(　^)(　　)(^　)(_^ )(^＿^)` by auto()
    val `(ﾟーﾟ)( ﾟー)(　ﾟ)(　　)(ﾟ　)(ーﾟ )(ﾟーﾟ)` by auto()
    val `(^_^)( ^_)(　^)(　　)(^　)(_^ )(^_^)` by auto()
    val `(･_･)( ･_)(　･)(　　)(･　)(_･ )(･_･)` by auto()
    val `(^∇^)( ^∇)(　^)(　　)(^　)(∇^ )(^∇^)` by auto()
    val `(･∀･)( ･∀)(　･)(　　)(･　)(∀･ )(･∀･)` by auto()
    val `(ﾟ◇ﾟ)( ﾟ◇)(　ﾟ)(　　)(ﾟ　)(◇ﾟ )(ﾟ◇ﾟ)` by auto()
    val `(^∀^)( ^∀)(　^)(　　)(^　)(∀^ )(^∀^)` by auto()
    val `(･◇･)( ･◇)(　･)(　　)(･　)(◇･ )(･◇･)` by auto()
    val `(ﾟ▽ﾟ)( ﾟ▽)(　ﾟ)(　　)(ﾟ　)(▽ﾟ )(ﾟ▽ﾟ)` by auto()
    val `(ﾟ∇ﾟ)( ﾟ∇)(　ﾟ)(　　)(ﾟ　)(∇ﾟ )(ﾟ∇ﾟ)` by auto()
    val `(ﾟ∀ﾟ)( ﾟ∀)(　ﾟ)(　　)(ﾟ　)(∀ﾟ )(ﾟ∀ﾟ)` by auto()
    val `(ﾟ＿ﾟ)( ﾟ_)(　ﾟ)(　　)(ﾟ　)(_ﾟ )(ﾟ＿ﾟ)` by auto()
    val `(ﾟ_ﾟ)( ﾟ_)(　ﾟ)(　　)(ﾟ　)(_ﾟ )(ﾟ_ﾟ) 　` by auto()
    val `(･∇･)( ･∇)(　･)(　　)(･　)(∇･ )(･∇･) 　` by auto()
    val `(･＿･)( ･_)(　･)(　　)(･　)(_･ )(･＿･) 　` by auto()
    val `‹‹＼(´ω` )／››‹‹＼( 　´)／››‹‹＼( ´ω`)／››` by auto("‹‹\\(´ω` )/››‹‹\\( 　´)/››‹‹\\( ´ω`)/››")
    val `‹‹ヽ( ･ω･ )／››‹‹ヽ( ･)／›› ‹‹ヽ( ･ω･ )／››` by auto("‹‹ヽ( ･ω･ )/››‹‹ヽ( ･)/›› ‹‹ヽ( ･ω･ )/››")
    val `(°o°)(°o。)(。o。)(。o°)(°o°)(°o。)(。o。)(。o°)` by auto()
    val `ヽ(･∀･)ﾉ━(∀･ﾉ)━(･ﾉ )━ヽ( )ﾉ━( ヽ･)━(ヽ･∀)━ヽ(･∀･)ﾉ` by auto()
    val `⊂⌒~⊃｡Д｡）⊃━⊂⌒O｡Д｡）⊃━O（｡Д｡）O━⊂（｡Д｡O⌒⊃━⊂（｡Д｡⊂~⌒⊃` by auto()
    val `(=ﾟωﾟ)ﾉ━( =ﾟω)━( 　=ﾟ)━(　　)━(ﾟ= ﾉ )━(ωﾟ=ﾉ)━(=ﾟωﾟ)ﾉ` by auto("(=ﾟωﾟ)ﾉ━( =ﾟω)━( 　=ﾟ)━(　　)━(ﾟ= ﾉ )━(ωﾟ=ﾉ)━(=ﾟωﾟ)ﾉ")
    val `＜丶｀∀´＞━＜丶｀∀＞━＜　丶｀＞━＜　　丶＞━＜　　　＞━＜´　　　＞━＜∀´　　＞━＜丶｀∀´＞` by auto("<丶｀∀´>━<丶｀∀>━<　丶｀>━<　　丶>━<　　　>━<´　　　>━<∀´　　>━<丶｀∀´>")
    val `(´･ω･`)━( ´･ω･)━( 　´･ω)━( 　　)━( 　　)━(ω･´　)━(･ω･´)━(｀･ω･´)` by auto("(´･ω･`)━( ´･ω･)━( 　´･ω)━( 　　)━( 　　)━(ω･´　)━(･ω･´)━(｀･ω･´)")
}
